#include<iostream>
#include<cstring>
#include<cstdio>
#include<queue>
#include<stack>
#include<algorithm>
using namespace std;




int main()
{
//    int f[100];
//    f[0]=7;
//    f[1]=11;
//    for(int i=2;i<100;i++){ ///注意超限的问题
//        f[i]=f[i-1]+f[i-2];
//        if(f[i]%3==0) cout<<f[i-1]<<" "<<f[i-2]<<" "<<i<<endl;///不要小瞧递归的力量
//    }
//    list:
//    11 7 2
//    76 47 6
//    521 322 10
//    3571 2207 14
//    24476 15127 18
//    167761 103682 22
//    1149851 710647 26
//    7881196 4870847 30
//    54018521 33385282 34
//    370248451 228826127 38
//    -188849053 -1757246660 43
//    -2134944766 -1946095713 45
//    -1040232917 666858215 50
//    -1786982321 -1413607619 53
//    -290832574 401772391 57
//    -248845697 -68952940 61
//    1959437020 -1451087305 66
    int n;
    while(scanf("%d",&n)==1){
        if((n+2)%4==0) printf("yes\n");
        else printf("no\n");
    }
    return 0;
}
